# Advent of SQL

In [3]:
import pandas as pd
from dotenv import load_dotenv
import os

In [4]:
# Load environment variables from the .env file
load_dotenv()

# Get username and pwd
username = os.getenv('PG_USERNAME')
pwd = os.getenv('PG_PASSWORD')

In [5]:
%load_ext sql

# Connecting to db
%sql postgresql://{username}:{pwd}@localhost:5432/santa_workshop

# Fixing 'pretty-table' bug
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### <b>Day 0:</b> The Great Christmas Analytics Crisis of 2024

In [ ]:
%%sql 

WITH cities_scored AS (
    SELECT country, 
        city, 
        AVG(naughty_nice_score) AS avg_score
    FROM children
    JOIN christmaslist
    ON children.child_id = christmaslist.child_id
    WHERE was_delivered = TRUE
    GROUP BY country, city
    HAVING count(*) >= 5
),
cities_ranked AS (
    SELECT country, 
        city, 
        avg_score, 
        RANK() OVER (PARTITION BY country ORDER BY avg_score DESC) AS city_rank
    FROM cities_scored
)

SELECT country, city, avg_score
FROM cities_ranked
WHERE city_rank <= 3
ORDER BY avg_score DESC;

 * postgresql://tovat:***@localhost:5432/santa_workshop
6 rows affected.

[('France', 'Lyon', Decimal('90.6000000000000000')),
 ('UK', 'Manchester', Decimal('90.6000000000000000')),
 ('France', 'Paris', Decimal('89.5000000000000000')),
 ('UK', 'London', Decimal('89.5000000000000000')),
 ('UK', 'Birmingham', Decimal('88.0000000000000000')),
 ('Netherlands', 'Rotterdam', Decimal('39.0000000000000000'))]

### <b>Day 1:</b> Santa's Gift Lists Parser
- JSON, CASE, JOINS

In [ ]:
%%sql

SELECT name,
    wishes->>'first_choice' as primary_wish,
    wishes->>'second_choice' as backup_wish,
    (wishes->'colors'->>0) AS favorite_color,
    json_array_length(wishes::json->'colors') as color_count,
    CASE 
        WHEN difficulty_to_make = 1 THEN 'Simple Gift'
        WHEN difficulty_to_make = 2 THEN 'Moderate Gift'
        WHEN difficulty_to_make >= 3 THEN 'Complex Gift'
    END AS gift_complexity,
    CASE 
        WHEN category = 'outdoor' THEN 'Outside Workshop'
        WHEN category = 'educational' THEN 'Learning Workshop'
        ELSE 'General Workshop'
    END AS workshop_assignment
from 
    wish_lists
    INNER JOIN children
    ON wish_lists.child_id = children.child_id
    LEFT JOIN toy_catalogue 
    ON wish_lists.wishes->>'first_choice' = toy_catalogue.toy_name
ORDER BY 
    name ASC
LIMIT 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[('Abagail', 'Building sets', 'LEGO blocks', 'Blue', 1, 'Complex Gift', 'Learning Workshop'),
 ('Abbey', 'Stuffed animals', 'Teddy bears', 'White', 4, 'Complex Gift', 'General Workshop'),
 ('Abbey', 'Toy trains', 'Toy trains', 'Pink', 2, 'Complex Gift', 'General Workshop'),
 ('Abbey', 'Barbie dolls', 'Play-Doh', 'Purple', 1, 'Moderate Gift', 'General Workshop'),
 ('Abbey', 'Yo-yos', 'Building blocks', 'Blue', 5, 'Simple Gift', 'General Workshop')]

### <b>Day 2:</b> Santa's Jumbled Letters
- UNION, CTE, ASCII, STRING_AGG (function to concatenate strings and place a sep between them)

In [ ]:
%%sql
-- Solution by friekert on Reddit

SELECT string_agg(character, '')
from (
  SELECT chr(value) as character from letters_a
  UNION ALL
  SELECT chr(value) from letters_b
) subquery
WHERE subquery.character ~* '[a-zA-Z\s!?,.;:()-]';

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Dear Santa, I hope this letter finds you well in the North Pole! I want a SQL course for Christmas!\n',)]

### <b>Day 3:</b> The Greatest Christmas Dinner Ever!
- CTE, XML

In [ ]:
%%sql 

WITH parsed_data AS (
    SELECT
        COALESCE(
            (xpath('//total_present/text()', menu_data))[1]::text::integer,
            (xpath('//total_count/text()', menu_data))[1]::text::integer,
            (xpath('//total_guests/text()', menu_data))[1]::text::integer
        ) AS total_guests,
        (xpath('//food_item_id/text()', menu_data))::text[] AS array_food_item
    from christmas_menus
)

SELECT
    food_item,
    COUNT(*) AS frequency
FROM parsed_data,
    UNNEST(array_food_item) AS food_item
WHERE total_guests > 78
GROUP BY food_item
ORDER BY frequency DESC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('493', 117)]

### <b>Day 4:</b> The Great Toy Tag Migration of 2024

- Array functions, SET operations

In [ ]:
%%sql

SELECT toy_id, 
    -- Count new tags that were added
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(new_tags) 
        EXCEPT 
        SELECT UNNEST(previous_tags)) as added_set) as added_tags,
    -- Count unchanged tags
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(new_tags) 
        INTERSECT 
        SELECT UNNEST(previous_tags)) as unchanged_set) as unchanged_tags,
    -- Count removed tags
    (SELECT COUNT(*) 
    from (
        SELECT UNNEST(previous_tags) 
        EXCEPT 
        SELECT UNNEST(new_tags)) as removed_set) as removed_tags
from toy_production
ORDER BY added_tags DESC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(2726, 98, 2, 0)]

### <b>Day 5:</b> Santa's Production Dashboard

- LAG (function to access a previous row from a column), ROUND, Window functions

In [ ]:
%%sql

WITH diff_calc as (
    SELECT production_date, 
        toys_produced, 
        LAG(toys_produced) OVER (ORDER BY production_date) as previous_day_production
    from toy_production
)
SELECT production_date, 
    toys_produced,
    previous_day_production,
    toys_produced - previous_day_production as production_change,
    ROUND((toys_produced - previous_day_production) * 100.00 / previous_day_production, 2) as production_change_percentage
from diff_calc
ORDER BY production_change_percentage DESC nulls last
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(datetime.date(2017, 3, 20), 2327, 3, 2324, Decimal('77466.67'))]

### <b>Day 6:</b> Making Presents Fairer

- Subquery, Aggregates

In [ ]:
%%sql

SELECT children.name as child_name,
    gifts.name as gift_name,
    gifts.price as gift_price
from children
INNER JOIN gifts
ON children.child_id = gifts.child_id
WHERE gifts.price >
    (SELECT AVG(gifts.price)
        FROM gifts)
ORDER BY gifts.price ASC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Hobart', 'art easel', Decimal('497.44'))]

### <b>Day 7:</b> Santa's Cartesian Elf Skill-Matching Program

- Window functions

In [5]:
%%sql

SELECT DISTINCT
    FIRST_VALUE(elf_id) OVER (PARTITION BY primary_skill ORDER BY years_experience DESC, elf_id) as max_years_experience,
    FIRST_VALUE(elf_id) OVER (PARTITION BY primary_skill ORDER BY years_experience, elf_id) as min_years_experience,
    primary_skill as shared_skill
from workshop_elves
ORDER BY max_years_experience
LIMIT 3;

 * postgresql://tovat:***@localhost:5432/santa_workshop
3 rows affected.

[(50, 13551, 'Toy making'),
 (4153, 3611, 'Gift sorting'),
 (10497, 1016, 'Gift wrapping')]

### <b>Day 8:</b> The Great North Pole Bureaucracy Bust of 2024

- Recursive CTE

In [19]:
%%sql

WITH RECURSIVE managers as (
    SELECT staff_id, 
        staff_name,
        manager_id
    FROM staff
UNION ALL
    SELECT s.staff_id, 
        s.staff_name, 
        s.manager_id
    FROM staff s
    INNER JOIN managers m 
    ON s.manager_id = m.staff_id
)
SELECT staff_id, count(*)
FROM managers
GROUP BY staff_id
ORDER BY 2 DESC
LIMIT 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[(57121, 24), (65616, 24), (51291, 24), (54839, 24), (65631, 24)]

### <b>Day 9:</b> Reindeer Training Records 🦌

- CTE, Aggregate functions

In [21]:
%%sql 

SELECT *
from training_sessions
Limit 10;

 * postgresql://tovat:***@localhost:5432/santa_workshop
10 rows affected.

[(1, 1, 'Rooftop Landing', Decimal('76.00'), datetime.date(2024, 12, 6), 'Starry'),
 (2, 1, 'Emergency Stop', Decimal('70.00'), datetime.date(2024, 12, 5), 'Moonlit'),
 (3, 1, 'Weather Endurance', Decimal('78.00'), datetime.date(2024, 12, 4), 'Aurora'),
 (4, 1, 'Sprint Start', Decimal('98.00'), datetime.date(2024, 12, 3), 'Clear'),
 (5, 1, 'High-Speed Turn', Decimal('90.00'), datetime.date(2024, 12, 2), 'Starry'),
 (6, 1, 'Formation Flying', Decimal('83.00'), datetime.date(2024, 12, 1), 'Starry'),
 (7, 1, 'Sprint Start', Decimal('86.00'), datetime.date(2024, 11, 30), 'Windy'),
 (8, 1, 'Sprint Start', Decimal('70.00'), datetime.date(2024, 11, 29), 'Foggy'),
 (9, 1, 'Emergency Stop', Decimal('75.00'), datetime.date(2024, 11, 28), 'Clear'),
 (10, 1, 'Gift Load Balance', Decimal('81.00'), datetime.date(2024, 11, 27), 'Moonlit')]

In [57]:
%%sql

WITH calc_avg_speed as ( 
    SELECT t.reindeer_id,
        r.reindeer_name,
        t.exercise_name,
        AVG(t.speed_record) as avg_speed_per_exercise_type
    FROM training_sessions t
    JOIN reindeers r
    ON t.reindeer_id = r.reindeer_id
    WHERE r.reindeer_name <> 'Rudolf'
    GROUP BY t.reindeer_id, r.reindeer_name, t.exercise_name
    ORDER BY reindeer_id
)

SELECT reindeer_name,
    ROUND(MAX(avg_speed_per_exercise_type), 2) as highest_average_score
FROM calc_avg_speed
GROUP BY reindeer_name
ORDER BY highest_average_score DESC
LIMIT 3;

 * postgresql://tovat:***@localhost:5432/santa_workshop
3 rows affected.

[('Cupid', Decimal('88.64')),
 ('Blitzen', Decimal('88.38')),
 ('Vixen', Decimal('88.01'))]

### <b>Day 10:</b> The Christmas Party Drinking List 🍸

- CTE, Filter

In [62]:
%%sql 
select DISTINCT(drink_name) 
from drinks

 * postgresql://tovat:***@localhost:5432/santa_workshop
6 rows affected.

[('Mulled wine',),
 ('Hot Cocoa',),
 ('Eggnog',),
 ('Peppermint Schnapps',),
 ('Baileys',),
 ('Sherry',)]

In [91]:
%%sql 

WITH drinks_per_day as ( 
    SELECT date, 
        sum(quantity) FILTER (WHERE drink_name = 'Hot Cocoa') as hot_cocoa_total,
        SUM(quantity) FILTER (WHERE drink_name = 'Peppermint Schnapps') AS peppermint_total,
        SUM(quantity) FILTER (WHERE drink_name = 'Eggnog') AS eggnog_total
    from drinks
    GROUP BY date
    ORDER BY date 
)

SELECT date
from drinks_per_day
WHERE hot_cocoa_total = 38 AND
    peppermint_total = 298 AND
    eggnog_total = 198

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(datetime.date(2024, 3, 14),)]

### <b>Day 11:</b> The Christmas Tree Famine 🎄

- Window functions, Average over

In [ ]:
%%sql 
select *
from treeharvests 
limit 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[('Merry Grove 1', 2024, 'Spring', 246),
 ('Merry Grove 1', 2024, 'Summer', 113),
 ('Merry Grove 1', 2024, 'Fall', 271),
 ('Merry Grove 1', 2024, 'Winter', 330),
 ('Northern Fields 2', 2024, 'Spring', 281)]

:

In [127]:
%%sql 

SELECT field_name,
        harvest_year, 
        season,
        trees_harvested,
        ROUND(AVG(trees_harvested) OVER (
            PARTITION BY harvest_year, field_name 
            ORDER BY 
                CASE 
                    WHEN season = 'Spring' THEN 1
                    WHEN season = 'Summer' THEN 2
                    WHEN season = 'Fall' THEN 3
                    WHEN season = 'Winter' THEN 4  
                END 
            ROWS BETWEEN 2 PRECEDING AND CURRENT ROW), 2) as rolling_avg_three_seasons
from treeharvests
--WHERE field_name = 'Northern Gardens 62' --> just to verify the rolling avg over seasons are correct
order by rolling_avg_three_seasons DESC
LIMIT 10;

 * postgresql://tovat:***@localhost:5432/santa_workshop
10 rows affected.

[('Northern Gardens 62', 2024, 'Winter', 412, Decimal('327.67')),
 ('Northern Woods 54', 2024, 'Winter', 365, Decimal('325.00')),
 ('Frosty Grove 50', 2024, 'Winter', 359, Decimal('319.00')),
 ('Festive Gardens 61', 2024, 'Fall', 349, Decimal('315.67')),
 ('Arctic Acres 13', 2024, 'Winter', 332, Decimal('315.67')),
 ('Starlit Valley 81', 2024, 'Spring', 313, Decimal('313.00')),
 ('Festive Forest 31', 2024, 'Winter', 338, Decimal('312.67')),
 ('Polar Forest 55', 2024, 'Winter', 295, Decimal('312.00')),
 ('Polar Ridge 6', 2024, 'Spring', 311, Decimal('311.00')),
 ('Polar Ridge 6', 2024, 'Summer', 310, Decimal('310.50'))]

### <b>Day 12:</b> The Great Gift Ranking 🧢
- Percentile, window function

In [ ]:
%%sql 

-- TODO: Add a dense rank to get the second highest percentile directly

SELECT gift_name,
    ROUND(percentile::numeric, 2) as percentile
FROM (
    SELECT gift_name,
        COUNT(r.gift_id) as gift_requested,
        PERCENT_RANK() OVER (ORDER BY COUNT(r.gift_id)) as percentile
    FROM gifts g
    JOIN gift_requests r
    ON g.gift_id = r.gift_id
    GROUP BY g.gift_id
) subquery
ORDER BY percentile DESC, gift_name ASC
LIMIT 20;

 * postgresql://tovat:***@localhost:5432/santa_workshop
20 rows affected.

[('costume trunk', Decimal('0.92')),
 ('finger paint set', Decimal('0.92')),
 ('hoverboard', Decimal('0.92')),
 ('jump rope', Decimal('0.92')),
 ('magic kit', Decimal('0.92')),
 ('musical keyboard', Decimal('0.92')),
 ('rocking horse', Decimal('0.92')),
 ('talking globe', Decimal('0.92')),
 ('toy submarine', Decimal('0.92')),
 ('chemistry set', Decimal('0.86')),
 ('friendship bracelet maker', Decimal('0.86')),
 ('learning tablet', Decimal('0.86')),
 ('magic 8 ball', Decimal('0.86')),
 ('magic wand', Decimal('0.86')),
 ('toy rocket', Decimal('0.86')),
 ('bowling set', Decimal('0.72')),
 ('building blocks', Decimal('0.72')),
 ('crystal growing kit', Decimal('0.72')),
 ('flying drone', Decimal('0.72')),
 ('magic treehouse', Decimal('0.72'))]

### <b>Day 13:</b> Santas Christmas Card List 💌
- Window functions, SPLIT_PART, Arrays

In [51]:
%%sql

select DISTINCT(ID), name, email_addresses
from contact_list
limit 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[(1, 'Gabriel Night', ['gabriel.night@workshop.info', 'gabriel.night398@snowflake.net', 'gabriel.night44@elves.biz', 'gabriel.night743@elves.net', 'gabriel.night814@reindee ... (309 characters truncated) ... night719@candycane.net', 'gabriel.night714@presents.ai', 'gabriel.night87@presents.info', 'gabriel.night795@sleigh.ai', 'gabriel.night951@tinsel.com']),
 (2, 'Jack Berry', ['jack.berry@bells.ai', 'jack.berry712@mistletoe.com', 'jack.berry73@snowflake.com', 'jack.berry439@sleigh.org', 'jack.berry918@snowflake.info', 'jack ... (271 characters truncated) ... lake.biz', 'jack.berry41@tinsel.ai', 'jack.berry299@tinsel.com', 'jack.berry689@stockings.net', 'jack.berry539@gifts.info', 'jack.berry492@bells.com']),
 (3, 'Joy North', ['joy.north@northpole.info', 'joy.north161@northpole.biz']),
 (4, 'Winter Wood', ['winter.wood@presents.ai', 'winter.wood420@northpole.com', 'winter.wood442@holly.biz', 'winter.wood110@elves.biz', 'winter.wood202@presents.com', 'winter.wood407@presents.ai']),
 (5, 'Eve Wood', ['eve.wood@stockings.ai', 'eve.wood700@elves.ai', 'eve.wood366@snowflake.info', 'eve.wood346@mistletoe.com', 'eve.wood387@workshop.ai', 'eve.wood348@reindeer.info', 'eve.wood11@gifts.net', 'eve.wood301@reindeer.net', 'eve.wood436@reindeer.org', 'eve.wood822@elves.net'])]

In [50]:
%%sql 

WITH total_domains as (
    SELECT id, 
        SPLIT_PART(UNNEST(email_addresses), '@', 2) as domain
    FROM contact_list
)

SELECT domain, 
    count(domain) as total_emails
from total_domains
group by domain
order by total_emails DESC
limit 10;

 * postgresql://tovat:***@localhost:5432/santa_workshop
10 rows affected.

[('bells.org', 155),
 ('stockings.net', 154),
 ('gifts.biz', 149),
 ('bells.com', 146),
 ('holly.biz', 145),
 ('bells.net', 143),
 ('presents.com', 142),
 ('sleigh.ai', 142),
 ('tinsel.info', 141),
 ('tinsel.org', 141)]

### <b>Day 14:</b> Where is Santa's Green Suit?
- Array functions, JSON

In [ ]:
%%sql 

select * from santarecords 
limit 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(1, datetime.date(2024, 12, 10), [{'cost': 26.47, 'color': 'white', 'pickup': '2024-12-13', 'garment': 'robe', 'drop_off': '2024-12-10', 'receipt_id': 'R839506'}, {'cost': 47.79, 'col ... (352 characters truncated) ... ceipt_id': 'R577987'}, {'cost': 38.62, 'color': 'red', 'pickup': '2024-12-14', 'garment': 'boots', 'drop_off': '2024-12-10', 'receipt_id': 'R217032'}])]

In [62]:
%%sql 

select value->>'drop_off' as drop_off_date
from santarecords,
lateral jsonb_array_elements(cleaning_receipts)
where value->>'garment' = 'suit' AND value->>'color' = 'green'
ORDER BY drop_off_date DESC
limit 5;

 * postgresql://tovat:***@localhost:5432/santa_workshop
5 rows affected.

[('2024-12-22',),
 ('2024-12-22',),
 ('2024-11-28',),
 ('2024-11-27',),
 ('2024-11-15',)]

### <b>Day 15:</b> Santa is missing!
- PostGIS extension, Geometry (ST_Within)

In [67]:
%%sql 

SELECT a.place_name
from areas a 
JOIN sleigh_locations sl
ON ST_Within(
    sl.coordinate::geometry, 
    a.polygon::geometry
)
WHERE sl.timestamp = (SELECT MAX(timestamp) FROM sleigh_locations)

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Moscow',)]

### <b>Day 16:</b> Santa's Delivery Time Analysis
- LEAD (function like LAG but returns the next value instead), Geometry (ST_Intersects), CTE

In [7]:
%%sql

WITH lags as (
    SELECT coordinate, 
        timestamp, 
        LEAD(timestamp) OVER (ORDER BY timestamp) as next_timestamp
    FROM sleigh_locations
)

SELECT place_name, 
    SUM(next_timestamp - timestamp) as total_duration
from lags
JOIN areas
ON ST_Intersects(lags.coordinate, areas.polygon)
GROUP BY place_name
ORDER BY total_duration DESC
LIMIT 1;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[('Paris', datetime.timedelta(seconds=5400))]

### <b>Day 17:</b> Christmas time zone madness
- CTE, Timezone

Expected solution is not quite right.

In [48]:
%%sql 

WITH UTC_times as (
    select workshop_name, 
    business_start_time, 
    business_end_time, 
    (CURRENT_DATE || ' ' || business_start_time)::timestamp AT TIME ZONE timezone at time zone 'UTC' AS UTC_start,
    (CURRENT_DATE || ' ' || business_end_time)::timestamp AT TIME ZONE timezone at time zone 'UTC' AS UTC_end,
    (CURRENT_DATE || ' ' || business_start_time)::timestamptz AT TIME ZONE timezone AS UTC_start1,
    (CURRENT_DATE || ' ' || business_end_time)::timestamptz AT TIME ZONE timezone AS UTC_end1


from workshops
)
SELECT MAX(UTC_start), MAX(UTC_start1), MIN(UTC_end), MIN(UTC_end1)
from UTC_times

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(datetime.datetime(2024, 12, 17, 14, 30), datetime.datetime(2024, 12, 17, 12, 0), datetime.datetime(2024, 12, 17, 12, 30), datetime.datetime(2024, 12, 17, 11, 30))]

In [46]:
%%sql

select (max((current_date ||' '||business_start_time)::timestamp at time zone timezone at time zone 'UTC'))::time from workshops;

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(datetime.time(14, 30),)]

### <b>Day 18:</b> Who has the most peers?
!!Currently not working to download data!!

### <b>Day 19:</b> Performance Review Season

In [60]:
%%sql 

WITH calcs as (
    SELECT salary,
        year_end_performance_scores[array_length(year_end_performance_scores, 1)] as last_score,
        AVG(year_end_performance_scores[array_length(year_end_performance_scores, 1)]) OVER () as avg_scores
    from employees
)
SELECT 
    ROUND(
        SUM(CASE 
                WHEN last_score > avg_scores THEN salary * 1.15
                ELSE salary
            END), 2) as total_salary_with_bonuses
FROM calcs

 * postgresql://tovat:***@localhost:5432/santa_workshop
1 rows affected.

[(Decimal('5491552488.10'),)]